{
  "1": {
      "1": ["TR", "Answers all parts of the task", "Changing 'made an inevitable result that' to 'led to the widespread dominance of' improves clarity and precision, directly addressing the essay's topic."],
      "2": ["GRA", "Word Form Error", "Correcting 'language' to 'languages' adjusts the plurality to match the context of global language spread."],
      "3": ["GRA", "Word Form Error", "Adjusting 'part' to 'parts' correctly reflects the plurality needed in this context."],
      "4": ["LR", "Word Choice Enhancement", "Replacing 'earth' with 'world' and restructuring the sentence removes redundancy and enhances readability."],
      "5": ["LR", "Word Choice Enhancement", "Changing 'price' to 'development' refines the terminology to better fit the context of language evolution."],
      "6": ["CC", "Redundant fillers", "Streamlining the sentence by replacing a longer phrase with 'has come at a cost' enhances conciseness and focus."],
      "7": ["LR", "Word Choice Enhancement", "Replacing 'people' with 'individuals' provides a more formal tone appropriate for academic writing."],
      "8": ["LR", "Word Choice Enhancement", "Changing 'phenomenon' to 'trend' updates the language to a more precise and contemporary term."],
      "9": ["GRA", "Verb Usage Error", "Replacing 'bring' with 'lead to' corrects the verb form for describing potential future outcomes."],
      "10": ["CC", "Added a Cohesive Device", "Rephrasing to include 'although there are also' improves the flow and introduces contrast effectively."],
      "11": ["LR", "Word Choice Enhancement", "Replacing 'obvious to observe the' with 'notable' simplifies and clarifies the statement."]
  },
  "2": {
      "12": ["TR", "Presents a clear position", "Changing 'believe' to 'argue' strengthens the assertion, presenting a clearer position on the issue."],
      "13": ["LR", "Word Choice Enhancement", "Correcting 'the dominated language poses the' to 'dominant languages challenge' improves grammatical accuracy and clarity."],
      "14": ["GRA", "Word Form Error", "Adjusting 'to culture' to 'cultural' correctly forms the adjective needed to modify 'diversity'."],
      "15": ["TR", "Extends supports to main ideas", "Changing 'Some local' to 'Local' and simplifying the phrase enhances focus on the main idea about cultural heritage."],
      "16": ["CC", "Redundant fillers", "Replacing a lengthy descriptive phrase with 'integral to cultural heritage' streamlines the sentence and focuses on key information."],
      "17": ["GRA", "Word Form Error", "Correcting 'domestic' to 'native' provides a more appropriate and specific term for languages."],
      "18": ["CC", "Added a Cohesive Device", "Using 'Yet, as' introduces a contrast and continues the narrative smoothly."],
      "19": ["CC", "Added a Cohesive Device", "Inserting 'as' helps in maintaining the flow and linking ideas logically."],
      "20": ["LR", "Word Choice Enhancement", "Replacing 'will forget these tales gradually through speaking less' with 'increasingly abandon' condenses and strengthens the statement."],
      "21": ["CC", "Added a Cohesive Device", "Inserting this phrase clarifies the consequence and enhances the logical progression of ideas."],
      "22": ["CC", "Added a Cohesive Device", "Replacing 'Furthermore' with 'Moreover' continues the argument with a stronger transition."],
      "23": ["CC", "Added a Cohesive Device", "Clarifying the educational focus's impact on national identity strengthens the coherence of the argument."],
      "24": ["GRA", "Word Syntax Error", "Correcting 'are tended to get weak' to 'sense of' fixes the awkward phrasing and improves readability."],
      "25": ["LR", "Word Choice Enhancement", "Replacing the more informal 'about world history' with 'in global rather' raises the formality and precision of the discourse."],
      "26": ["GRA", "Word Form Error", "Changing 'domestic' to 'local' aligns better with formal academic language use."]
  },
  "3": {
      "27": ["CC", "Added a Cohesive Device", "Changing 'When it comes to' to 'Regarding' provides a smoother transition and a more formal tone."],
      "28": ["TR", "Extends supports to main ideas", "Replacing 'development' with 'impacts' directs attention more specifically to the positive aspects, aligning better with the task's requirements."],
      "29": ["GRA", "Word Form Error", "Correcting 'this trends' to 'this trend, several' addresses a grammatical error and clarifies the subject."],
      "30": ["CC", "Added a Cohesive Device", "Replacing 'such' with 'several' enhances clarity and precision in listing points."],
      "31": ["CC", "Added a Cohesive Device", "Replacing 'could be listed' with 'stand out' introduces the points with more confidence and relevance."],
      "32": ["TR", "Presents a clear position", "Correcting 'the dominated' to 'dominant' strengthens the argument by correctly identifying the subject."],
      "33": ["LR", "Word Choice Enhancement", "Capitalizing 'English' and adding 'particularly' specifies and corrects the term, while also emphasizing its significance."],
      "34": ["CC", "Added a Cohesive Device", "Expanding the sentence to include a cause-effect relationship enhances logical flow and coherence."],
      "35": ["TR", "Extends supports to main ideas", "Simplifying 'the cooperations between areas. One' to 'the rise' of enhances clarity and focus on the main point about multinational corporations."],
      "36": ["CC", "Redundant fillers", "Removing 'the results is the' eliminates unnecessary wording, making the statement more direct and impactful."],
      "37": ["TR", "Presents a clear position", "Changing 'are rising rapid, which relays' to 'that depend' clarifies the dependency relationship and strengthens the argument structure."],
      "38": ["CC", "Redundant fillers", "Deleting 'the' before 'efficient' removes a grammatical redundancy, enhancing the precision of the text."],
      "39": ["GRA", "Word Form Error", "Correcting 'boarder' to 'border' fixes a spelling mistake, thus avoiding confusion and maintaining professionalism."],
      "40": ["CC", "Redundant fillers", "Eliminating 'by same language' simplifies the text and focuses on the essential elements of communication."],
      "41": ["CC", "Redundant fillers", "This deletion avoids repetition of the phrase 'Such cross-border companies,' which can be seen as a redundancy in the paragraph structure."],
      "42": ["CC", "Added a Cohesive Device", "Rephrasing to include 'not only create jobs locally but' introduces a parallel structure that enhances the flow and emphasizes the dual benefits."],
      "43": ["TR", "Extends supports to main ideas", "Changing 'provide more jobs for' to 'contribute to the tax revenue of' broadens the discussion to include economic benefits, aligning with the essay's argumentative scope."],
      "44": ["GRA", "Word Form Error", "Correcting 'local government' to 'local governments' ensures grammatical agreement in number, aligning with the plural form used throughout the essay."]
  },
  "4": {
      "45": ["CC", "Added a Cohesive Device", "Replacing 'Furthermore' with 'Moreover' continues the narrative with a stronger, more formal transition."],
      "46": ["LR", "Word Choice Enhancement", "Changing 'acquiring dominated' to 'mastering a dominant' not only corrects grammar but also enhances the tone, making it more appropriate for academic writing."],
      "47": ["CC", "Added a Cohesive Device", "Rephrasing to 'connects individuals globally' simplifies and strengthens the connection to global opportunities, enhancing coherence."],
      "48": ["CC", "Added a Cohesive Device", "Replacing 'which means more possibilities to get the different' with 'opening up diverse' broadens the scope and improves the flow of information."],
      "49": ["TR", "Extends supports to main ideas", "Changing 'opportunities of studying' to 'opportunities for education' not only corrects a preposition but also aligns better with formal academic language."],
      "50": ["TR", "Extends supports to main ideas", "Correcting 'working' to 'employment' substitutes an informal term with a more formal one, enhancing the academic tone of the essay."],
      "51": ["CC", "Added a Cohesive Device", "Rephrasing 'living. By' to 'relocation. For' clarifies the types of opportunities available and ensures a smoother transition between ideas."],
      "52": ["GRA", "Word Form Error", "Correcting 'By using english' to 'For instance, English' not only fixes the capitalization of 'English' but also introduces an example, enhancing clarity and specificity."],
      "53": ["TR", "Extends supports to main ideas", "Expanding the example about English speakers provides a clearer, more comprehensive illustration of the benefits, enhancing the essay's argumentative impact."],
      "54": ["CC", "Redundant fillers", "Removing detailed examples that restate previously mentioned benefits simplifies the text and focuses on the key message."],
      "55": ["CC", "Redundant fillers", "This deletion avoids repetition and maintains the focus on the central argument about the benefits of global opportunities."],
      "56": ["CC", "Added a Cohesive Device", "Inserting 'a broad range of universities worldwide, and migrate' expands the discussion on educational opportunities, enhancing coherence and detail."],
      "57": ["GRA", "Word Form Error", "Replacing 'more ideal country and live there' with 'more easily' corrects awkward phrasing and improves readability."],
      "58": ["CC", "Added a Cohesive Device", "Adding 'without facing significant' clarifies the extent of the benefits discussed, improving the logical flow."],
      "59": ["LR", "Word Choice Enhancement", "Changing 'problem' to 'barriers' uses a more specific and academically appropriate term."]
  },
  "5": {
      "60": ["CC", "Added a Cohesive Device", "Inserting 'while' introduces a contrast that effectively summarizes the essay's discussion of positive and negative aspects."],
      "61": ["GRA", "Word Form Error", "Changing 'spreading' to 'spread' corrects the gerund to a noun form, better fitting the sentence structure."],
      "62": ["TR", "Presents a clear position", "Modifying 'dominated language causes loss of nation' to 'dominant languages may erode national' updates the language to reflect a more considered, speculative stance on the impact of language dominance."],
      "63": ["LR", "Word Choice Enhancement", "Adjusting 'damage the culture' to 'diminish cultural' not only corrects the grammatical structure but also softens the assertion, making it less absolute."],
      "64": ["CC", "Redundant fillers", "Eliminating 'However,' simplifies the transition and maintains the focus on the concluding arguments."],
      "65": ["TR", "Extends supports to main ideas", "Replacing 'brings advantages' with 'offers substantial benefits' enhances the strength of the statement and aligns with the formal tone required for IELTS writing."],
      "66": ["LR", "Word Choice Enhancement", "Changing 'country economy' to 'national economies' corrects the phrasing to a more standard, academically accepted term."],
      "67": ["TR", "Extends supports to main ideas", "Modifying 'personal development' to 'individual advancement' provides a more precise and academically suitable term, enhancing clarity and impact."]
  }
}
