{
    "topic": "Around the world, fewer languages are being spoken, and just a few are becoming more common. Is this a positive or negative development?",
    "origin_content_dict": {
        "1": "Globalization has made an inevitable result that certain language, spread widely in most part of the earth, which became more and more dominated. The price of these dominated language’s development, is that fewer people speak local languages. Some people are concerned about this phenomenon and believe it may bring negative developments. While it is also obvious to observe the positive changes.",
        "2": "Opponents believe that the dominated language poses the challenge to culture diversity and national identity. Some local tales, which can be considered as a part of local culture, are usually recorded by domestic languages. However, people will forget these tales gradually through speaking less their local languages. Furthermore, young people are tended to get weak national identity, as some school only teach students more national languages, and the students become more interested about world history than domestic history.",
        "3": "When it comes to the positive development of this trends, such points could be listed. Firstly,  the dominated languages, especially english, efficiently improves the cooperations between areas. One of the results is the multinational corporations are rising rapid, which relays on the efficient cross-boarder communication by same language. Such cross-boarder companies, which will also provide more jobs for local people, and of course, more tax income for local government.",
        "4": "Furthermore, acquiring dominated language gives people the chance to connect to the whole world, which means more possibilities to get the different opportunities of studying, working and living. By using english, which is almost the most popular language around the world, a researcher could easily find and understand the latest science theory through online magazine like nature,  a student could have much more choices to apply his ideal universities around the world instead of locally, a refugee could go to a more ideal country and live there without language problem.",
        "5": "In conclusion, the spreading of dominated language causes loss of nation identity and damage the culture diversity. However, it also brings advantages for both country economy and personal development."
    }
}